Repository: alexander-naumov/debian-handbook-ru
Catalog: */00b_foreword.po
Languages: es_es

source: While we were obviously satisfied with the book's success, we always hoped that Eyrolles would convince an international editor to translate it into English. We had received numerous comments explaining how the book helped people to get started with Debian, and we were keen to have the book benefit more people in the same way.
es_es: Mientras nos estabamos satisfechos, obviamente, con el éxito del libro, siempre esperamos que Eyrolles convenciera a un editor internacional para que realizar la traducción al Inglés. Hemos recibido numerosos comentarios que explican cómo el libro ayudó a la gente a empezar con Debian, y estábamos interesados en ayudar a más personas de la misma manera.

source: Alas, no English-speaking editor that we contacted was willing to take the risk of translating and publishing the book. Not put off by this small setback, we decided to negotiate with our French editor Eyrolles to recuperate the necessary rights to translate the book into English and to try to publish it ourselves.
es_es: Por desgracias, no conseguimos contactar con ningún editor de habla inglesa que estuviera dispuesto a correr el riesgo de traducir y publicar el libro. No nos dejamos intimidar por este pequeño contratiempo, decidimos negociar con nuestro editor francés Eyrolles para recuperar los derechos necesarios para traducir el libro al inglés y tratar de publicarlo nosotros mismos.

source: Translating a book of 450 pages is a considerable effort that requires several months of work. For self-employed people like Roland and me, we had to ensure a minimum income to mobilize the time necessary to complete the project. So we set up a crowd-funding campaign on Ulule and asked people to pledge money towards the project. <ulink type="block" url="http://www.ulule.com/debian-handbook/" />
es_es: Traducir un libro de 450 páginas supone un esfuerzo considerable que requiere varios meses de trabajo. Para las trabajadores autónomos como Roland y como yo, hemos tenido que garantizar unos ingresos mínimos para poder disponer del tiempo necesario para completar el proyecto. Así que pusimos en marcha una campaña de financiación pública en Ulule y pedimos a la gente que contribuyera en el proyecto comprometiéndose economicamente. <ulink type="block" url="http://www.ulule.com/debian-handbook/" />

source: The campaign had two goals: raising €15,000 for the translation and completing a €25,000 liberation fund to get the resulting book published under a free license — that is, a license that fully follows the Debian Free Software Guidelines.
es_es: La campaña tenía dos objetivos: alcanzar la cifra de 15.000 € para la poder realizar la traducción y llegar a dispober de un fondo de € 25.000 para liberar el libro resultante publicada bajo una licencia libre — es decir, una licencia que sigue fielmente las Directrices del Software Libre de Debian.

source: When the Ulule campaign ended, the first goal had been achieved with €24,345 raised. The liberation fund was not complete however, with only €14,935 raised. As initially announced, the liberation campaign continued independently from Ulule on the book's official website.
es_es: Cuando terminó la campaña de Ulule, se había logrado alcanzar el objetivo de los 24.245€. Sin embargo, el fondo para la liberación del libro no se había completado, solo 14.395€. Tal y como se anunció inicialmente, la campaña para la liberación del libro continuó en la web oficial del libro independientemente de Ulule.

source: While we were busy translating the book, donations towards the liberation continued to flow in… And in April 2012, the liberation fund was completed. You can thus benefit from this book under the terms of a free license.
es_es: Mientras estábamos ocupados traduciendo el libro, siguieron las donaciones para la liberación del libro... Y en abril de 2012, se alcanzó el fondo necesario para la liberación. De este modo se puede beneficiarse de este libro bajo los términos de una licencia libre.

source: We would like to thank everybody who contributed to these fundraising campaigns, either by pledging some money or by passing the word around. We couldn't have done it without you.
es_es: Nos gustaría dar las gracias a todos los que contribuyeron a estas campañas de recaudación de fondos, ya sea mediante la promesa de algo de dinero o pasando la voz. No podríamos haberlo hecho sin ti.

source: We had the pleasure of getting significant contributions from many free software-friendly companies and organizations. Thank you to <ulink url="http://www.codelutin.com">Code Lutin</ulink>, <ulink url="http://eof.eu.org">École Ouverte Francophone</ulink>, <ulink url="http://www.evolix.fr">Evolix</ulink>, <ulink url="http://www.fantinibakery.com">Fantini Bakery</ulink>, <ulink url="http://fsffrance.org">FSF France</ulink>, <ulink url="http://www.offensive-security.com">Offensive Security</ulink> (the company behind <ulink url="http://www.backtrack-linux.org">BackTrack Linux</ulink>), <ulink url="http://www.opensides.be">Opensides</ulink>, <ulink url="http://www.proxmox.com">Proxmox Server Solutions Gmbh</ulink>, SSIELL (Société Solidaire d'Informatique En Logiciels Libres), and <ulink url="http://www.syminet.com">Syminet</ulink>.
es_es: Tuvimos el placer de conseguir importantes contribuciones de muchas las empresas y organizaciones afines al software libre. Gracias a <ulink url="http://www.codelutin.com">Code Lutin</ulink>, <ulink url="http://eof.eu.org">École Ouverte Francophone</ulink>, <ulink url="http://www.evolix.fr">Evolix</ulink>, <ulink url="http://www.fantinibakery.com">Fantini Bakery</ulink>, <ulink url="http://fsffrance.org">FSF France</ulink>, <ulink url="http://www.offensive-security.com">Offensive Security</ulink> (the company behind <ulink url="http://www.backtrack-linux.org">BackTrack Linux</ulink>), <ulink url="http://www.opensides.be">Opensides</ulink>, <ulink url="http://www.proxmox.com">Proxmox Server Solutions Gmbh</ulink>, SSIELL (Société Solidaire d'Informatique En Logiciels Libres), y a <ulink url="http://www.syminet.com">Syminet</ulink>.

source: We want to address our special thanks to those who contributed at least €35 (sometimes much more!) to the liberation fund. We are glad that there are so many people who share our values about freedom and yet recognize that we deserved a compensation for the work that we have put into this project.
es_es: Queremos dar las gracias especialmente a aquellos que han contribuido con 35€ como mínimo (a veces mucho más!) al fondo para la liberación del libro. Estamos encantados de que haya tantas personas que compartan nuestros valores de libertad y sin embargo reconocen que merecíamos una compensación por el trabajo realizado en este proyecto.

source: So thank you Alain Coron, Alain Thabaud, Alan Milnes, Alastair Sherringham, Alban Dumerain, Alessio Spadaro, Alex King, Alexandre Dupas, Ambrose Andrews, Andre Klärner, Andreas Olsson, Andrej Ricnik, Andrew Alderwick, Anselm Lingnau, Antoine Emerit, Armin F. Gnosa, Avétis Kazarian, Bdale Garbee, Benoit Barthelet, Bernard Zijlstra, Carles Guadall Blancafort, Carlos Horowicz — Planisys S.A., Charles Brisset, Charlie Orford, Chris Sykes, Christian Bayle, Christian Leutloff, Christian Maier, Christian Perrier, Christophe Drevet, Christophe Schockaert (R3vLibre), Christopher Allan Webber, Colin Ameigh, Damien Dubédat, Dan Pettersson, Dave Lozier, David Bercot, David James, David Schmitt, David Tran Quang Ty, Elizabeth Young, Fabian Rodriguez, Ferenc Kiraly, Frédéric Perrenot — Intelligence Service 001, Fumihito Yoshida, Gian-Maria Daffré, Gilles Meier, Giorgio Cittadini, Héctor Orón Martínez, Henry, Herbert Kaminski, Hideki Yamane, Hoffmann Information Services GmbH, Holger Burkhardt, Horia Ardelean, Ivo Ugrina, Jan Dittberner, Jim Salter, Johannes Obermüller, Jonas Bofjäll, Jordi Fernandez Moledo, Jorg Willekens, Joshua, Kastrolis Imanta, Keisuke Nakao, Kévin Audebrand, Korbinian Preisler, Kristian Tizzard, Laurent Bruguière, Laurent Hamel, Leurent Sylvain, Loïc Revest, Luca Scarabello, Lukas Bai, Marc Singer, Marcelo Nicolas Manso, Marilyne et Thomas, Mark Janssen — Sig-I/O Automatisering, Mark Sheppard, Mark Symonds, Mathias Bocquet, Matteo Fulgheri, Michael Schaffner, Michele Baldessari, Mike Chaberski, Mike Linksvayer, Minh Ha Duong, Moreau Frédéric, Morphium, Nathael Pajani, Nathan Paul Simons, Nicholas Davidson, Nicola Chiapolini, Ole-Morten, Olivier Mondoloni, Paolo Innocenti, Pascal Cuoq, Patrick Camelin, Per Carlson, Philip Bolting, Philippe Gauthier, Philippe Teuwen, PJ King, Praveen Arimbrathodiyil (j4v4m4n), Ralf Zimmermann, Ray McCarthy, Rich, Rikard Westman, Robert Kosch, Sander Scheepens, Sébastien Picard, Stappers, Stavros Giannouris, Steve-David Marguet, T. Gerigk, Tanguy Ortolo, Thomas Hochstein, Thomas Müller, Thomas Pierson, Tigran Zakoyan, Tobias Gruetzmacher, Tournier Simon, Trans-IP Internet Services, Viktor Ekmark, Vincent Demeester, Vincent van Adrighem, Volker Schlecht, Werner Kuballa, Xavier Neys, and Yazid Cassam Sulliman.
es_es: Así que gracias a Alain Coron, Alain Thabaud, Alan Milnes, Alastair Sherringham, Alban Dumerain, Alessio Spadaro, Alex King, Alexandre Dupas, Ambrose Andrews, Andre Klärner, Andreas Olsson, Andrej Ricnik, Andrew Alderwick, Anselm Lingnau, Antoine Emerit, Armin F. Gnosa, Avétis Kazarian, Bdale Garbee, Benoit Barthelet, Bernard Zijlstra, Carles Guadall Blancafort, Carlos Horowicz — Planisys S.A., Charles Brisset, Charlie Orford, Chris Sykes, Christian Bayle, Christian Leutloff, Christian Maier, Christian Perrier, Christophe Drevet, Christophe Schockaert (R3vLibre), Christopher Allan Webber, Colin Ameigh, Damien Dubédat, Dan Pettersson, Dave Lozier, David Bercot, David James, David Schmitt, David Tran Quang Ty, Elizabeth Young, Fabian Rodriguez, Ferenc Kiraly, Frédéric Perrenot — Intelligence Service 001, Fumihito Yoshida, Gian-Maria Daffré, Gilles Meier, Giorgio Cittadini, Héctor Orón Martínez, Henry, Herbert Kaminski, Hideki Yamane, Hoffmann Information Services GmbH, Holger Burkhardt, Horia Ardelean, Ivo Ugrina, Jan Dittberner, Jim Salter, Johannes Obermüller, Jonas Bofjäll, Jordi Fernandez Moledo, Jorg Willekens, Joshua, Kastrolis Imanta, Keisuke Nakao, Kévin Audebrand, Korbinian Preisler, Kristian Tizzard, Laurent Bruguière, Laurent Hamel, Leurent Sylvain, Loïc Revest, Luca Scarabello, Lukas Bai, Marc Singer, Marcelo Nicolas Manso, Marilyne et Thomas, Mark Janssen — Sig-I/O Automatisering, Mark Sheppard, Mark Symonds, Mathias Bocquet, Matteo Fulgheri, Michael Schaffner, Michele Baldessari, Mike Chaberski, Mike Linksvayer, Minh Ha Duong, Moreau Frédéric, Morphium, Nathael Pajani, Nathan Paul Simons, Nicholas Davidson, Nicola Chiapolini, Ole-Morten, Olivier Mondoloni, Paolo Innocenti, Pascal Cuoq, Patrick Camelin, Per Carlson, Philip Bolting, Philippe Gauthier, Philippe Teuwen, PJ King, Praveen Arimbrathodiyil (j4v4m4n), Ralf Zimmermann, Ray McCarthy, Rich, Rikard Westman, Robert Kosch, Sander Scheepens, Sébastien Picard, Stappers, Stavros Giannouris, Steve-David Marguet, T. Gerigk, Tanguy Ortolo, Thomas Hochstein, Thomas Müller, Thomas Pierson, Tigran Zakoyan, Tobias Gruetzmacher, Tournier Simon, Trans-IP Internet Services, Viktor Ekmark, Vincent Demeester, Vincent van Adrighem, Volker Schlecht, Werner Kuballa, Xavier Neys, y a Yazid Cassam Sulliman.

source: Special Thanks to Contributors
es_es: Agradecimientos Especiales para Colaboradores

source: This book would not be what it is without the contributions of several persons who each played an important role. We would like to thank Marilyne Brun, who helped us to translate the sample chapter and who worked with us to define some common translation rules. She also revised several chapters which were desperately in need of supplementary work. Thank you to Anthony Baldwin (of Baldwin Linguas) who translated several chapters for us.
es_es: Este libro no sería lo que es sin la colaboración de varias personas que han jugado un importante papel. Nos gustaría dar las gracias a Marilyne Brun, quien nos ayudó a traducir el capítulo de ejemplo y que ha trabajado con nosotros para definir unas reglas comunes para la traducción. También revisó varios capítulos que necesitabamos desesperadamente de una ayuda adicional. Muchas gracias a Anthony Baldwin (de Linguas Baldwin) que ha traducido varios capítulos para nosotros.

source: We benefited from the generous help of proofreaders: Daniel Phillips, Gerold Rupprecht, Gordon Dey, Jacob Owens, and Tom Syroid. They each reviewed many chapters. Thank you very much!
es_es: Hemos aprovechado la generosa ayuda de los correctores: Daniel Phillips, Gerold Rupprecht, Gordon Dey, Owens Jacob, y Syroid Tom. Cada uno de ellos examinó muchos capítulos. Muchas gracias!

source: If you have the pleasure to read these lines in a paperback copy of the book, then you should join us to thank Benoît Guillon, Jean-Côme Charpentier, and Sébastien Mengin who worked on the interior book design. Benoît is the upstream author of <ulink url="http://dblatex.sourceforge.net">dblatex</ulink> — the tool we used to convert DocBook into LaTeX (and then PDF). Sébastien is the designer who created this nice book layout and Jean-Côme is the LaTeX expert who implemented it as a stylesheet usable with dblatex. Thank you guys for all the hard work!
es_es: Si tiene el placer de leer estas líneas en papel impreso, entonces únase a nosotros en el agradecimiento a Benoît Guillon, Jean-Côme Charpentier, y a Sébastien Mengin quienes trabajaron en el diseño interior del libro. Benoît es el autor original de <ulink url="http://dblatex.sourceforge.net">dblatex</ulink> — la herramienta que usamos para convertir DocBook en LaTeX (y luego en PDF). Sébastien es el diseñador que creo el bonito diseño de este libro y Jean-Côme es el experto en LaTeX que lo implentó como una hoja de estilo usable con dblatex. Gracias chicos por el duro trabajo que habeis realizado!

source: Finally, thank you to Thierry Stempfel for the nice pictures introducing each chapter, and thank you to Doru Patrascu for the beautiful book cover.
es_es: Finalmente, gracias a Thierry Stempfel por las bonitas imagenes que aparecen en la presentación de cada capítulo, y gracias a Doru Patrascu por la bonita cubierta del libro.

source: Personal Acknowledgments from Raphaël
es_es: Reconocimiento Personal de Raphaël

source: First off, I would like to thank Nat Makarevitch, who offered me the possibility to write this book and who provided strong guidance during the year it took to get it done. Thank you also to the fine team at Eyrolles, and Muriel Shan Sei Fan in particular. She has been very patient with me and I learned a lot with her.
es_es: En primer lugar, me gustaría dar las gracias a Nat Makarevitch, quien me ofreció la posibilidad de escribir este libro y que me orientó durante el año que dispuse para hacerlo. Gracias también al buen equipo de Eyrolles, y a Muriel Shan Fan Sei en particular. Ella ha sido muy paciente conmigo y he aprendido mucho con ella.

source: The period of the Ulule campaign was very demanding for me but I would like to thank everybody who helped to make it a success, and in particular the Ulule team who reacted very quickly to my many requests. Thank you also to everybody who promoted the operation. I don't have any exhaustive list (and if I had it would probably be too long) but I would like to thank a few people who were in touch with me: Joey-Elijah Sneddon and Benjamin Humphrey of OMG! Ubuntu, Frédéric Couchet of April.org, Jake Edge of Linux Weekly News, Clement Lefebvre of Linux Mint, Ladislav Bodnar of Distrowatch, Steve Kemp of Debian-Administration.org, Christian Pfeiffer Jensen of Debian-News.net, Artem Nosulchik of LinuxScrew.com, Stephan Ramoin of Gandi.net, Matthew Bloch of Bytemark.co.uk, the team at Divergence FM, Rikki Kite of Linux New Media, Jono Bacon, the marketing team at Eyrolles, and numerous others that I have forgotten (sorry about that).
es_es: El periodo de tiempo de que duró la campaña de Ulule fue muy exigente para mí, pero me gustaría dar las gracias a todos los que colaboraron para que fuera un éxito, y en particular al equipo de Ulule que respondió muy rápidamente a mis muchas peticiones. No tengo ninguna lista donde se recoja de forma exhaustiva todas las personas que me ayudaron (y si la tuviera, problablemente fuera demasiado larga), pero me gustaría dar las gracias a algunas personas que estuvieron en contacto conmigo: Joey-Elijah Sneddon y Benjamin Humphrey de OMG! Ubuntu, Frédéric Couchet de April.org, Jake Edge de Linux Weekly News, Clement Lefebvre de Linux Mint, Ladislav Bodnar de Distrowatch, Steve Kemp de Debian-Administration.org, Christian Pfeiffer Jensen de Debian-News.net, Artem Nosulchik de LinuxScrew.com, Stephan Ramoin de Gandi.net, Matthew Bloch de Bytemark.co.uk, el equipo de Divergence FM, Rikki Kite de Linux New Media, Jono Bacon, el equipo de marketing de Eyrolles, y otros muchos que me he olvidado (siento haberlos olvidado).

source: I would like to address a special thanks to Roland Mas, my co-author. We have been collaborating on this book since the start and he has always been up to the challenge. And I must say that completing the Debian Administrator's Handbook has been a lot of work…
es_es: Me gustaría hacer llegar mi agradecimiento personal a Roland Mas, mi co-autor. Hemos estado colaborando en este libro desde el principio y siempre ha estado a la altura. Y debo decir que completar el Manual del administrador de Debian ha sido un montón de trabajo ...

source: Last but not least, thank you to my wife, Sophie. She has been very supportive of my work on this book and on Debian in general. There have been too many days (and nights) when I left her alone with our 2-year-old son to make some progress on the book. I am grateful for her support and know how lucky I am to have her.
es_es: Por último, pero no menos importante, gracias a mi esposa, Sophie. Ha sido un gran apoyo para mi trabajo en este libro y en Debian en general. Ha habido muchos días (y noches) en que la dejé sola con nuestro hijo de 2 años de edad para lograr avanzar algo en el libro. Estoy muy agradecido por su apoyo y sé lo afortunado que soy de tenerla.

source: Personal Acknowledgments from Roland
es_es: Agradecimientos Personales de Roland

source: Well, Raphaël preempted most of my “external” thank-yous already. I am still going to emphasize my personal gratitude to the good folks at Eyrolles, with whom collaboration has always been pleasant and smooth. Hopefully the results of their excellent advice hasn't been lost in translation.
es_es: Bien, Raphaël ya adelantó gran parte de mis agradecimientos. Aún así, voy a enfatizarmi agradecimiento personal a la buena gente de Eyrolles, con la que la colaboración siempre ha sido agradable y fluida. Esperemos que los resultados de sus excelentes consejos no se hayan perdido en la traducción.

source: I am extremely grateful to Raphaël for taking on the administrative part of this English edition. From organizing the funding campaign to the last details of the book layout, producing a translated book is so much more than just translating and proofreading, and Raphaël did (or delegated and supervised) it all. So thanks.
es_es: Estoy extremadamente agradecido a Raphaël por llevar a cabo la parte administrativa de la edición inglesa. Desde organizar la campaña para obtener fondos hasta los detalles de la apariencia del libro, crear un libro traducido es mucho más que una simple traducción y una corrección , Raphaël lo hizo todo (o por lo menos delegó y lo supervisó). Así que gracias.

source: Thanks also to all who more or less directly contributed to this book, by providing clarifications or explanations, or translating advice. They are too many to mention, but most of them can usually be found on various #debian-* IRC channels.
es_es: Gracias también a todos los que más o menos directamente han contribuido a este libro, al proporcionar las aclaraciones o explicaciones, o consejo para la traducción. Son demasiados para mencionar, pero la mayoría de ellos se puede encontrar en varios canales de IRC de #debian-*.

source: More personal thanks go to my friends and my clients, for their understanding when I was less responsive because I was working on this book, and also for their constant support, encouragement and egging on. You know who you are; thanks.
es_es: Más agradecimiento personales a mis amigos y mis clientes, por su comprensión, cuando yo era menos flexibleegg on porque yo estaba trabajando en este libro, y también por su constante apoyo, aliento e inspiración. Ustedes saben quienes son, gracias.

source: And finally; I am sure they would be surprised by being mentioned here, but I would like to extend my gratitude to Terry Pratchett, Jasper Fforde, Tom Holt, William Gibson, Neal Stephenson, and of course the late Douglas Adams. The countless hours I spent enjoying their books are directly responsible for my being able to take part in translating this one.
es_es: Y, por último, estoy seguro de que se sorprendería por ser mencionado aquí, pero me gustaría expresar mi agradecimiento a Terry Pratchett, Jasper Fforde, Tom Holt, William Gibson, Neal Stephenson, y por supuesto el difunto Douglas Adams. Las incontables horas que pasé disfrutando de sus libros son directamente responsables de que yo sea capaz de tomar parte en la traducción de éste.
