Repository: alexander-naumov/debian-handbook-ru
Catalog: */00b_foreword.po
Languages: es_es

source: Foreword
es_es: Prefacio

source: Linux has been garnering strength for the last few years, and its growing popularity drives more and more users to make the jump. The first step on that path is to pick a distribution. This is an important decision, because each distribution has its own peculiarities, and future migration costs can be avoided if the right choice is made from the start.
es_es: En los últimos años Linux ha adquirido fuerza, y su cada vez mayor popularidad impulsa a cada vez más y más usuarios a dar el salto. El primer paso en ese camino consiste en elegir una distribución. Es una decisión importante, ya que cada distribución tiene sus propias peculiaridades, y si se elección desde el principio es la correcta se pueden evitar los costos de migraciones futuras.

source: <emphasis>BACK TO BASICS</emphasis> Linux distribution, Linux kernel
es_es: <emphasis>VOLVER A LOS CIMIENTOS</emphasis> Linux distribución, Linux kernel

source: <primary>Linux</primary><secondary>distribution</secondary>
es_es: <primary>Linux</primary><secondary>distribución</secondary>

source: <primary>distribution</primary><secondary>Linux distribution</secondary>
es_es: <primary>distribución</primary><secondary>distribución Linux</secondary>

source: Strictly speaking, Linux is only a kernel, the core piece of software sitting between the hardware and the applications.
es_es: Estrictamente hablando, Linux es solo un nucleo, la pieza central de software que se encuentra entre el hardware y las aplicaciones.

source: A “Linux distribution” is a full operating system; it usually includes the Linux kernel, an installer program, and most importantly applications and other software required to turn a computer into an actually useful tool.
es_es: Una "distribución Linux" es un sistema operativo completo; normalmente incluye el Kernel de Linux, un programa instalador, y sobre todo aplicaciones y otro software necesario para convertir un ordenador en una herramienta útil.

source: Debian GNU/Linux is a “generic” Linux distribution that fits most users. The purpose of this book is to show its many aspects so you can make an informed decision when choosing.
es_es: Debian GNU/Linux es una distribución de Linux "genérica" que se ajusta a la mayoría de los usuarios. El propósito de este libro es mostrar todos sus aspectos para que pueda tomar una decisión fundada en el momento de elegir una distribución.

source: Why This Book?
es_es: ¿Por qué este libro?

source: <emphasis>CULTURE</emphasis> Commercial distributions
es_es: <emphasis>CULTURA</emphasis> Distribuciones comerciales

source: <primary>distribution</primary><secondary>commercial distribution</secondary>
es_es: <primary>distribución</primary><secondary>distribución comercial</secondary>

source: Most Linux distributions are backed by a for-profit company that develops them and sells them under some kind of commercial scheme. Examples include <emphasis>Ubuntu</emphasis>, mainly developed by <emphasis>Canonical Ltd.</emphasis>; <emphasis>Mandriva Linux</emphasis>, by French company <emphasis>Mandriva SA</emphasis>; and <emphasis>Suse Linux</emphasis>, maintained and made commercially available by <emphasis>Novell</emphasis>.
es_es: La mayoría de distribuciones Linux están respaldadas por empresas con fines lucrativos que las desarrollan y comercializan bajo algún tipo de proyecto comercial. Algunos ejemplos son <emphasis>Ubuntu</emphasis>, principalmente desarrollado por <emphasis>Canonical Ltd.</emphasis> ; <emphasis>Mandriva Linux</emphasis>, por la compañía francesa <emphasis>Mandriva SA</emphasis>; y <emphasis>Suse Linux</emphasis>, que es mantenida y comercializada por <emphasis>Novell</emphasis>.

source: At the other end of the spectrum lie the likes of Debian and the Apache Software Foundation (which hosts the development for the Apache web server). Debian is above all a project in the Free Software world, implemented by volunteers working together through the Internet.
es_es: En el extremo opuesto se encuentran los planteamientos de Debian y de la Apache Software Foundation (que alberga el desarrollo del servidor web Apache). Debian es ante todo un proyecto en el mundo del Software Libre, implementado por voluntarios que trabajan juntos a través de Internet.

source: Linux has gathered a fair amount of media coverage, which mostly benefits the distributions supported by a real marketing department — in other words, to company-backed distributions (Ubuntu, Red Hat, Suse, Mandriva, and so on). But Debian is far from being a marginal distribution; according to a German study made in early 2009, Debian is the most widely used distribution on servers (with nearly half of the responding companies having at least one Debian server), and the second most widely deployed on desktops (right behind Ubuntu, which is a Debian derivative). <ulink type="block" url="http://www.heise.de/open/artikel/Eingesetzte-Produkte-224518.html" />
es_es: Linux ha disfrutado de una gran cobertura mediática, lo cual beneficia a sobre todo a las distribuciones que apoyan en un departamente de marketing real — en otras palabras, a distribuciones respaldas por empresas (Ubuntu, Red Hat, Suse, Mandriva, etc). Sin embargo, Debian está lejos de ser una distribución marginal, según un estudio alemán realizado a principios de 2009, Debian es la distribución más utilizada en los servidores (casi la mitad de las empresas encuestadas tienen al menos un servidor de Debian), y el segundo más ampliamente desplegado en los escritorios (justo por detrás de Ubuntu, que es un derivado de Debian). <ulink type="block" url="http://www.heise.de/open/artikel/Eingesetzte-Produkte-224518.html" />

source: The purpose of this book is to help you discover this distribution. We hope to share the experience we've gathered since we joined the project as developers and contributors in 1998 (Raphaël) and 2000 (Roland). With any luck, our enthusiasm will be communicative, and maybe you'll join us sometime…
es_es: El propósito de este libro es ayudarle a descubrir esta distribución. Esperamos compartir la esperiencia que hemos acumulado desde que nos unimos al proyecto como desarrolladores y contribuidores en 1998 (Raphaël) y en 2000 (Roland). Con suerte, transmitiremos nuestro entusiasmo, y quizás decidas unirte a nosotros algún día...

source: The first edition of this book (in 2004) served to fill a gaping hole: it was the first French-language book that focused exclusively on Debian. At that time, many other books were written on the topic both for French-speaking and English-speaking readers. Unfortunately almost none of them got updated, and today we again find ourselves in a situation where there are very few good books on Debian. We truly hope that this first English edition will fill this gap and help many users.
es_es: La primera edición de este libro (en 2004) sirvió para llenar vacío: fue el primer libro en francés que se centró exclusivamente en Debian. En ese momento, se escribieron muchos otros libros sobre Debian, tanto para los lectores de habla francesa y como para los de habla inglesa. Lamentablemente casi ninguno de ellos se puso al día, y hoy nuevamente nos encontramos en una situación donde hay muy pocos libros buenos sobre Debian. Esperamos sinceramente que esta primera edición en inglés llene este vacío y ayude a muchos usuarios.

source: Who Is this Book For?
es_es: ¿Para quién es este libro?

source: We tried to make this book useful for many categories of readers. First, systems administrators (both beginners and experienced) will find explanations about the installation and deployment of Debian on many computers. They will also get a glimpse of most of the services available on Debian, along with matching configuration instructions and a description of the specifics coming from the distribution. Understanding the mechanisms involved in Debian's development will enable them to deal with unforeseen problems, knowing that they can always find help within the community.
es_es: Hemos intentado hacer un libro útil para muchas categorías de lectores. En primer lugar, administradores de sistemas (tanto principiantes como expertos) encontrarán explicaciones acerca de la instalación y despliegue en muchos equipos.También se harán una idea de la mayoría de los servicios disponibles en Debian, junto con las instrucciones de configuración y una descripción de las detallades de la distribución. Comprender los mecanismos que tienen lugar en el desarrollo de Debian les capacitará para tratar con problemas imprevistos, sabiendo que siempre pueden contar con la ayuda de la comunidad.

source: Users of another Linux distribution, or of another Unix variant, will discover the specifics of Debian, and should become operational very quickly while benefiting fully from the unique advantages of this distribution.
es_es: Los usuarios de otras distribuciones de Linux, o de otra variante de Unix, descubrirán las características específicas de Debian, y se adaptarán muy rápidamente mientras se benefician plenamente de las ventajas únicas de esta distribución.

source: Finally, readers who already have some knowledge of Debian and want to know more about the community behind it should see their expectations fulfilled. This book should make them much closer to joining us as contributors.
es_es: Finalmente, los lectores que ya tienen conocimientos previos de Debian y quieren conocer más acerca de la comunidad que se encuentra detrás de Debian verán sus expectativas cumplidas. Este libro debería acercarles mucho más a nosotros como colaboradores.

source: Chosen Approach
es_es: Enfoque

source: All of the generic documentation you can find about GNU/Linux also applies to Debian, since Debian includes most common free software. However, the distribution brings many enhancements, which is why we chose to primarily describe the “Debian way” of doing things.
es_es: Toda la documentación genérica que pueda encontrar acerca de GNU/Linux también es aplicable a Debian, ya que Debian incluye la mayoría del software libre. Sin embargo, la distribución incorpora muchas mejoras, por lo que hemos decidido describir en primer lugar la "forma de Debian" de hacer las cosas.

source: It is interesting to follow the Debian recommendations, but it is even better to understand their rationale. Therefore, we won't restrict ourselves to practical explanations only; we will also describe the project's workings, so as to provide you with comprehensive and consistent knowledge.
es_es: Es importante seguir las recomendaciones de Debian, pero es aún más importante conocer sus razones. Por lo tanto, no nos limitaremos solamente a explicaciones prácticas; también describiremos la forma en la que funciona el proyecto, de forma que le proporcionemos un conocimiento comprensible y consistente.

source: Book Structure
es_es: Estructura del Libro

source: <emphasis>NOTE</emphasis> Web site, authors' email
es_es: <emphasis>NOTA</emphasis> Página Web, email del autor

source: This book has its own website, which hosts whatever elements that can make it more useful. In particular, it includes an online version of the book with clickable links, and possible errata. Feel free to browse it and to leave us some feedback. We will be happy to read your comments or support messages. Send them by email to <email>hertzog@debian.org</email> (Raphaël) and <email>lolando@debian.org</email> (Roland). <ulink type="block" url="http://debian-handbook.info/" />
es_es: Este libro tiene su propia web, que alberga todos los elementos que pueden hacerlo más útil. En particular, incluye una versión online del libro con enlaces clickables, y fé de erratas. Siéntase totalmente libre de navegar a través de él y dejarnos su feedback. Nos alegragará leer sus comentarios o sus mensajes de apoyo. Envíe un email a <email>hertzog@debian.org</email> (Raphaël) and <email>lolando@debian.org</email> (Roland). <ulink type="block" url="http://debian-handbook.info/" />

source: <emphasis role="strong">Chapter 1</emphasis> focuses on a non-technical presentation of the Debian project and describes its goals and organization. These aspects are important because they define a general framework that others chapters will complete with more concrete information.
es_es: El <emphasis role="strong">capítulo 1</emphasis> se centra en una presentación no-técnica del proyecto Debian y se describe sus objetivos y su organización. Estos aspectos son importantes porque definen un marco general que se concretan en otros capítulos.

source: <emphasis role="strong">Chapters 2 and 3</emphasis> provide a broad outline of the case study. At this point, novice readers can take the time to read <emphasis role="strong">appendix B</emphasis>, where they'll find a short remedial course explaining a number of basic computing notions, as well as concepts inherent to any Unix system.
es_es: Los <emphasis role="strong">capítulos 2 y 3</emphasis> presentan en líneas generales el caso de estudio de ejemplo. Llegados a este punto, los lectores principiantes pueden echar un vistazo al <emphasis role="strong">apéndice B</emphasis>, donde pueden encontrar un breve curso que explica nociones básicas de informática, así como los conceptos inherentes a cualquier sistema Unix.

source: To get on with our real subject matter, we will quite naturally start with the installation process (<emphasis role="strong">chapter 4</emphasis>); <emphasis role="strong">chapters 5 and 6</emphasis> will unveil basic tools that any Debian administrator will use, such as those of the <emphasis role="strong">APT</emphasis> family, which is largely responsible for the distribution's excellent reputation. These chapters are in no way reserved to professionals, since everyone is their own administrator at home.
es_es: Para continuar, lógicamente vamos a empezar con el proceso de instalación (<emphasis role="strong">capítulo 4</emphasis>); <emphasis role="strong"> los capítulos 5 y 6</emphasis> darán a conocer las herramientas básicas que todo administrador de Debian utilizará, tales como las pertenecientes a la familia <emphasis role="strong">APT</emphasis>, que es en gran parte la responsable de la excelente reputación de la distribución. Estos capítulos no son exclusivamente para profesionales, puesto que cada uno en su casa es su propio administrador.

source: <emphasis role="strong">Chapter 7</emphasis> will be an important parenthesis; it describes workflows to efficiently use documentation and to quickly gain an understanding of problems in order to solve them.
es_es: El <emphasis role="strong">capítulo 7</emphasis> será un parentesis importante, describe los flujos de trabajo para usar eficientemente la documentación y para lograr comprender rápidamente los problemas para resolverlos.

source: The next chapters will be a more detailed tour of the system, starting with basic infrastructure and services (<emphasis role="strong">chapters 8 to 10</emphasis>) and going progressively up the stack to reach the user applications in <emphasis>chapter 13</emphasis>. <emphasis role="strong">Chapter 12</emphasis> deals with more advanced subjects that will most directly concern administrators of large sets of computers (including servers), while <emphasis role="strong">chapter 14</emphasis> is a brief introduction to the wider subject of computer security and gives a few keys to avoid most problems.
es_es: Los capítulos siguientes proporcionarán una visión más detallada del sistema, empezando por la infraestructura básica y los servicios (<emphasis role="strong">desde el capítulo 8 hasta el 10</emphasis>) y se irá progresivamente avanzado hasta las aplicaciones de usuario en el <emphasis>capítulo 13</emphasis>. El <emphasis role="strong">capítulo 12</emphasis> trata de temas más avanzados relacionados directamente con los administradores de grandes conjuntos de ordenadores (incluyendo servidores), mientras que el <emphasis role="strong">capítulo 14</emphasis> es una breve introducción a un tema más amplio que es la seguridad y proporciona algunas claves para evitar problemas.

source: <emphasis role="strong">Chapter 15</emphasis> is for administrators who want to go further and create their own Debian packages.
es_es: El <emphasis role="strong">capítulo 15</emphasis> es para administradores que quieran profundizar y crear sus propios paquetes de Debian.

source: <emphasis>VOCABULARY</emphasis> Debian package
es_es: <emphasis>VOCABULARIO</emphasis> Paquete Debian

source: <primary>package</primary><secondary>Debian package</secondary>
es_es: <primary>paquete</primary><secondary>paquete Debian</secondary>

source: <primary>package</primary><secondary>binary package</secondary>
es_es: <primary>paquete</primary><secondary>paquete binario</secondary>

source: <primary>package</primary><secondary>source package</secondary>
es_es: <primary>paquete</primary><secondary>paquete fuente</secondary>

source: <primary>source package</primary>
es_es: <primary>paquete fuente</primary>

source: A Debian package is an archive containing all the files required to install a piece of software. It is generally a file with a <filename>.deb</filename> extension, and it can be handled with the <command>dpkg</command> command. Also called <emphasis>binary package</emphasis>, it contains files that can be directly used (such as programs or documentation). On the other hand, a <emphasis>source package</emphasis> contains the source code for the software and the instructions required for building the binary package.
es_es: Una paquete Debian es un archivo que contiene todos los archivos necesario para instalar una pieza de software. Normalmente es un archivo con extensión <filename>.deb</filename>, y puede ser tratado con el comando <command>dpkg</command>. También conocido como <emphasis>paquete binario</emphasis>, contiene los archivos que pueden ser utilizados directamente (tales como programas y documentación). Por otro lado, un <emphasis>paquete fuente</emphasis> contiene el código fuente para el software y las instrucciones para construir un paquete binario.

source: The present English version is based on the fifth edition of the French book. This fifth edition was an important update, covering version 6.0 of Debian, code-named <emphasis role="distribution">Squeeze</emphasis>. Among the changes, Debian now sports two new architectures — <emphasis>kfreebsd-i386</emphasis> and <emphasis>kfreebsd-amd64</emphasis> — based on the FreeBSD kernel and supporting the associated technologies (<emphasis>jails</emphasis>, <emphasis>packet filter</emphasis> and so on). On Linux-based architectures, the 2.6.32 kernel extends support to all the main virtualization technologies (Xen/OpenVZ/LXC/KVM, see <xref linkend="sect.virtualization" />). All included packages have obviously been updated. Many improvements specifically target package maintainers, who can now use a simplified <filename>debian/rules</filename> (with debhelper's <command>dh</command> command); they also benefit from a standard patch management system integrated to <command>dpkg-source</command> (by using the <literal>3.0 (quilt)</literal> source package format).
es_es: La presente versión en castellano está basada en la quinta edición del libro francés. La quinta edición supuso una actualización importante, cubriendo la versión 6.0 de Debian, cuyo nombre es <emphasis role="distribution">Squeeze</emphasis>. Entre los cambios se encuentran: Debian se soporta sobre dos nuevas arquitecturas basadas en el kernel de FreeBSD — <emphasis>kfreebsd-i386</emphasis> y <emphasis>kfreebsd-amd64</emphasis> — y soporta tecnologías inter-relacionadas. (<emphasis>jails</emphasis>, <emphasis>packet filter</emphasis> y muchos más). En las arquitecturas basadas en Linux, el kernel 2.6.32 se amplía el soporte a las principales tecnologías de virtualización (Xen/OpenVZ/LXC/KVM, vea <xref linkend="sect.virtualization" />). Obviamente, todos los paquetes incluidos han sido actualizados. Muchas mejoras especialmente destinadas a mantenedores de paquetes, que ahora pueden usar <filename>reglas/debian</filename> (con el comando <command>dh</command> de debhelper); pueden beneficiarse además de un sistema integrado de gestión de parches éstandar con <command>dpkg-source</command> (usando el formato de paquete fuente <literal>3.0 (quilt)</literal> )

source: We have added some notes and remarks in sidebars. They have a variety of roles: they can draw attention to a difficult point, complete a notion of the case study, define some terms, or serve as reminders. Here is a list of the most common of these sidebars:
es_es: Hemos añadido algunas notas y comentarios en los recuadros. Tienen una funcionalidad múltiple: pueden remarcar un punto difícil, complementar nociones del caso de estudio de ejemplo, definir algunos términos o servir como recordatorios. A continuación se muestran una lista de las anotaciones más comunes:

source: BACK TO BASICS: a reminder for some information that is supposed to be known;
es_es: VOLVER A LOS CIMIENTOS: un recordatorio acerca de información que se supone que ya es conocida por el lector;

source: VOCABULARY: defines a technical term, sometimes Debian specific;
es_es: VOCABULARIO: define un término técnico, a veces específico de Debian;

source: COMMUNITY: highlights important persons or roles within the project;
es_es: COMUNIDAD: indica las personas o roles importantes dentro del proyecto;

source: TOOL: presents a relevant tool or service;
es_es: UTILIDAD: presenta una herramienta o servicio relevante;

source: IN PRACTICE: theory and practice do not always match; these sidebars contain advice resulting from our experience. They can also give detailed and concrete examples;
es_es: EN LA PRÁCTICA: teoría y la práctica no siempre coinciden; estos recuadros contienen consejos que son el resultado de nuestra experiencia. También pueden proporcionar ejemplos detallados y concretos;

source: other more or less frequent sidebars are rather explicit: CULTURE, TIP, CAUTION, GOING FURTHER, SECURITY, and so on.
es_es: otros recuadros más o menos frecuentes son bastante explícitas: CULTURA, SUGERENCIA, PRECAUCIÓN, YENDO MÁS ALLÁ, SEGURIDAD y otros.

source: Acknowledgments
es_es: Reconocimientos

source: A Bit of History
es_es: Un Poco de Historia

source: In 2003, Nat Makarevitch contacted me (Raphaël) because he wanted to publish a book on Debian in the <foreignphrase>Cahier de l'Admin</foreignphrase> (Admin's Handbook) collection that he was managing for Eyrolles, a leading French editor of technical books. I immediately accepted to write it. The first edition came out on 14th October 2004 and was a huge success — it was sold out barely four months later.
es_es: En 2003, Nat Makarevitch se puso en contacto conmigo (Raphaël) porque quería publicar un libro de Debian en la colección <foreignphrase>Cahier de l'Admin</foreignphrase> (Manual del Administrador) que estaba coordinando para Eyrolles, un editor francés de libros técnicos. Acepté escribirlo inmediatamente. La primera edición salió a la luz el 14 de octubre de 2004 y tuvo un gran éxito — se agotó apenas cuatro meses más tarde.

source: Since then, we have released 4 other editions of the French book, one for each subsequent Debian release. Roland Mas, who started working on the book as my proofreader, gradually became its co-author.
es_es: Desde entonces, hemos publicado 4 ediciones del libro en francés, uno para cada versión de Debian posterior. Roland Mas, que inicialmente trabajó en el libro como mi corrector, poco a poco se convirtió en su co-autor.
