Repository: alexander-naumov/debian-handbook-ru
Catalog: */90_derivative-distributions.po
Languages: it_it

source: Specificities
it_it: Specificita'

source: Particular Choices
it_it: Scelte Particolari

source: Derivative Distributions
it_it: Distribuzioni derivate

source: <indexterm><primary>derivative distribution</primary></indexterm> <indexterm><primary>distribution, derivative</primary></indexterm> Many Linux distributions are derivatives of Debian and reuse Debian's package management tools. They all have their own interesting properties, and it is possible one of them will fulfill your needs better than Debian itself.
it_it: <indexterm><primary>distribuzioni derivate</primary></indexterm> <indexterm><primary>distribuzioni derivate</primary></indexterm> Molte distribuzioni linux sono derivate di Debian e riusano gli strumenti di gestione dei pacchetti di debian. Tutte hanno le loro proprieta' interessanti ed e' possibile che una di loro soddisfi piu' di Debian stessa.

source: Census and Cooperation
it_it: Censimento e Cooperazione

source: The Debian project fully acknowledges the importance of derivative distributions and actively supports collaboration between all involved parties. This usually involves merging back the improvements initially developed by derivative distributions so that everyone can benefit and long-term maintenance work is reduced.
it_it: Il progetto Debian, riconosce pienamente l'importanza delle distribuzioni derivate e supporta la collaborazione tra tutte le parti coinvolte. Questo usualmente coinvolge

source: This explains why derivative distributions are invited to become involved in discussions on the <literal>debian-derivatives@lists.debian.org</literal> mailing-list, and to participate in the derivative census. This census aims at collecting information on work happening in a derivative so that official Debian maintainers can better track the state of their package in Debian variants. <ulink type="block" url="http://wiki.debian.org/DerivativesFrontDesk" /><ulink type="block" url="http://wiki.debian.org/Derivatives/Census" />
it_it: Questo spiega perché le distribuzioni derivate sono invitate a partecipare alle discussioni sulla mailing-list<literal>debian-derivatives@lists.debian.org</literal>, ed a partecipare al censimento delle derivate. Questo censimento ha lo scopo di raccogliere informazioni sul lavoro che avviene nelle derivate in modo che i manutentori Debian ufficiali possono seguire meglio lo stato del loro pacchetto in varianti di Debian. <ulink type="block" url="http://wiki.debian.org/DerivativesFrontDesk" /> <ulink type="block" url="http://wiki.debian.org/Derivatives/Census" />

source: Let us now briefly describe the most interesting and popular derivative distributions.
it_it: Vediamo ora di descrivere brevemente le distribuzioni derivate più interessanti e popolari.

source: <indexterm><primary>Ubuntu</primary></indexterm> Ubuntu made quite a splash when it came on the Free Software scene, and for good reason: Canonical Ltd., the company that created this distribution, started by hiring thirty-odd Debian developers and publicly stating the far-reaching objective of providing a distribution for the general public with a new release twice a year. They also committed to maintaining each version for a year and a half for both core and security-related components.
it_it: <indexterm><primary>Ubuntu</primary></indexterm> Ubuntu ha fatto un grande scalpore quando e' arrivata sulla scena del software libero e per buone ragioni:Canonical Ltd., la compagnia che ha creato questa distribuzione, ha iniziato con l'assuzione di una trentina di programmatori Debian ed ha dichiarato pubblicamente di voler raggiungere l'obiettivo fornire una distribuzione per il grande pubblico due volte l'anno. Si sono inoltre impegnati a mantenere ogni versione per un anno e mezzo sia per per il core che per i componenti relativi alla sicurezza.

source: These objectives necessarily involve a reduction in scope; Ubuntu focuses on a smaller number of packages than Debian, and relies primarily on the GNOME desktop (although an official Ubuntu derivative, called “Kubuntu”<indexterm><primary>Kubuntu</primary></indexterm>, relies on KDE). Everything is internationalized and made available in a great many languages.
it_it: Questi obiettivi comportano necessariamente una riduzione ddello scopo; Ubuntu si concentra su un numero minore di pacchetti di Debian, e si basa principalmente sul desktop GNOME (sebbene una derivata ufficiale di Ubuntu, chiamata “Kubuntu”<indexterm><primary>Kubuntu</primary></indexterm>, si basa su KDE). Tutto è internazionalizzato e reso disponibile in un gran numero di lingue.

source: So far, Ubuntu has managed to keep this release rhythm. They also publish <emphasis>Long Term Support</emphasis> (LTS) releases, with a 5-year maintenance promise. As of April 2012, the current LTS version is version 12.04, nicknamed Precise Pangolin. The latest non-LTS version is 11.10, nicknamed Oneiric Ocelot. Version numbers describe the release date: 11.10, for example, was released in October 2011.
it_it: Finora, Ubuntu è riuscito a tenere questo ritmo di rilascio. Loro pubblicano anche una <emphasis>Long Term Support</emphasis> (LTS) rilasciata, con una promessa di manutenzione di 5 anni. A partire da aprile 2012, la versione corrente è la versione LTS 12,04, soprannominato Precise Pangolin. L'ultima versione non-LTS e' la 11.10, soprannominato Oneiric Ocelot. I numeri di versione descrivono la data di uscita: 11.10, per esempio, è stato rilasciato nel mese di ottobre 2011.

source: Ubuntu has reached a wide audience in the general public. Millions of users were impressed by its ease of installation, and the work that went into making the desktop simpler to use.
it_it: Ubuntu ha raggiunto una vasta platea di pubblico in generale. Milioni di utenti sono rimasti impressionati dalla sua facilita' di installazione, ed dal lavoro che e' stato fatto per rendere il desktop facile da usare.

source: However, not everything is fine and dandy, especially for Debian developers who placed great hopes in Ubuntu contributing directly to Debian. Even though this situation has improved over the years, many have been irked by the Canonical marketing, which implied Ubuntu were good citizens in the Free Software world simply because they made public the changes they applied to Debian packages. Free Software proponents understand that an automatically-generated patch is of little use to the upstream contribution process. Getting one's work integrated requires direct interaction with the other party.
it_it: Tuttavia, non tutto e' rose e fiori (fine and dandy), soprattutto per i programmatori Debian che avevano nutrito grandi speranze nei contributi diretti di Ubuntu in Debian. Anche se questa situazione è migliorata nel corso degli anni, molti sono stati infastiditi dal marketing Canonical, che implicava che quelli di Ubuntu erano buoni cittadini nel mondo del Software Libero, semplicemente perche' rendevano pubblici i cambiamenti che applicavano ad i pacchetti Debian. I sostenitori del Software Libero sanno che una patch generata automaticamente è di poca utilità per il processo di contributo all'upstream. Ottenere l'integrazione del proprio lavoro richiede l'interazione diretta con l'altra parte.

source: This interaction is becoming more common over time, thanks in part to the Ubuntu community and the efforts it makes in educating its new contributors. But this policy is still not enforced by Canonical on its employees. Some kept true to their roots, and do make the required effort (Colin Watson, Martin Pitt and Matthias Klose are noteworthy in this regard), but others — often overworked — can no longer find it in them. <ulink type="block" url="http://www.ubuntu.com/" />
it_it: Questa interazione è sempre più comune nel tempo, grazie in parte alla comunità Ubuntu e gli sforzi che fa per educare i suoi nuovi collaboratori. Ma questa politica non viene ancora applicata da Canonical sui suoi dipendenti. Alcuni hanno mantenuto fede alle proprie radici, e fanno lo sforzo richiesto (Colin Watson, Martin Pitt e Matthias Klose sono degni di nota a questo proposito), ma gli altri - spesso oberati di lavoro - non riescono a farlo. <ulink type="block" url="http://www.ubuntu.com/" />

source: <indexterm><primary><foreignphrase>LiveCD</foreignphrase></primary></indexterm> <indexterm><primary>Knoppix</primary></indexterm> <indexterm><primary>bootable CD-ROM</primary></indexterm> <indexterm><primary>CD-ROM</primary><secondary>bootable</secondary></indexterm> The Knoppix distribution barely needs an introduction. It was the first popular distribution to provide a <emphasis>LiveCD</emphasis>; in other words, a bootable CD-ROM that runs a turn-key Linux system with no requirement for a hard-disk — any system already installed on the machine will be left untouched. Automatic detection of available devices allows this distribution to work in most hardware configurations. The CD-ROM includes almost 2 GB of (compressed) software.
it_it: <indexterm><primary><foreignphrase>LiveCD</foreignphrase></primary></indexterm> <indexterm><primary>Knoppix</primary></indexterm> <indexterm><primary>bootable CD-ROM</primary></indexterm> <indexterm><primary>CD-ROM</primary><secondary>bootable</secondary></indexterm> La distribuzione Knoppix ha appena bisogno di un'introduzione. E 'stata la prima distribuzione popolare a fornire un <emphasis> LiveCD </emphasis>, in altre parole, un CD-ROM che esegue un sistema Linux chiavi in mano senza necessità di un hard-disk - qualsiasi sistema già installato sul macchina sarà lasciato intatto. Il rilevamento automatico dei dispositivi disponibili permette a questa distribuzione di lavorare nella maggior parte delle configurazioni hardware. Il CD-ROM comprende quasi 2 GB (compressi) di software.

source: Combining this CD-ROM and a USB stick allows carrying your files with you, and to work on any computer without leaving a trace — remember that the distribution doesn't use the hard-disk at all. Knoppix is mostly based on LXDE (a lightweight graphical desktop), but many other distributions provide other combinations of desktops and software. This is, in part, made possible thanks to the <emphasis role="pkg">live-build</emphasis> Debian package that makes it relatively easy to create a LiveCD. <ulink type="block" url="http://live.debian.net/" />
it_it: Combinando questo CD-ROM e una chiavetta USB permette di portare i vostri file con voi, e di lavorare su qualsiasi computer senza lasciare traccia - ricorda che questa distribuzione non usa affatto l'hard disk. Knoppix è in gran parte basato su LXDE (un desktop grafico leggero), ma molte altre distribuzioni forniscono altre combinazioni di desktop e software. Questo è, in parte, reso possibile grazie al pacchetto Debian <emphasis role="pkg"> live-build </emphasis> che rende relativamente facile la creazione di un LiveCD. <ulink type="block" url="http://live.debian.net/" />

source: Note that Knoppix also provides an installer: you can first try the distribution as a LiveCD, then install it on a hard-disk to get better performance. <ulink type="block" url="http://www.knopper.net/knoppix/index-en.html" />
it_it: Notare che Knoppix fornisce anche un installatore: si puo' provare prima la distribuzione come LiveCD, poi installarla su un hard-disk per avere migliore prestazioni. <ulink type="block" url="http://www.knopper.net/knoppix/index-en.html" />

source: <indexterm><primary>Linux Mint</primary></indexterm> Linux Mint is a (partly) community-maintained distribution, supported by donations and advertisements. Their flagship product is based on Ubuntu, but they also provide a “Linux Mint Debian Edition” variant that evolves continuously (as it's based on Debian Testing). In both cases, the initial installation involves booting a LiveDVD.
it_it: <indexterm><primary>Linux Mint</primary></indexterm> Linux Mint è una (parzialmente) distribuzione gestito dalla comunità, sostenuto da donazioni e pubblicità. Il loro prodotto di punta è basata su Ubuntu, ma forniscono anche un "Linux Mint Debian Edition", variante che si evolve in modo continuo (inquanto si basa su Debian Testing). In entrambi i casi, l'installazione iniziale, comporta l'avvio di un LiveDVD.

source: The distribution aims at simplifying access to advanced technologies, and provides specific graphical user interfaces on top of the usual software. For instance, even though Linux Mint relies on GNOME, it provides a different menu system; similarly, the package management interface, although based on APT, provides a specific interface with an evaluation of the risk from each package update.
it_it: La distribuzione mira a semplificare l'accesso alle tecnologie avanzate, e fornisce specifiche interfacce grafiche sul software usuale. Per esempio, anche se Linux Mint si basa su GNOME, fornisce un diverso sistema di menu, allo stesso modo, l'interfaccia di gestione dei pacchetti, anche se basata su APT, fornisce una interfaccia specifica con una valutazione del rischio da ciascun pacchetto di aggiornamento.

source: <indexterm><primary>SimplyMEPIS</primary></indexterm> SimplyMEPIS is a commercial distribution very similar to Knoppix. It provides a turn-key Linux system from a LiveCD, and includes a number of non-free software packages: device drivers for nVidia video cards, Flash for animations embedded in many websites, RealPlayer, Sun's Java, and so on. The goal is to provide a 100 % working system out of the box. Mepis is internationalized and handles many languages. <ulink type="block" url="http://www.mepis.org/" />
it_it: SimplyMEPIS è una distribuzione commerciale, molto simile a Knoppix. Esso fornisce un sistema linux chaivi in da un LineCD, e include un certo numero di pacchetti di software non libero: i driver per schede video nVidia, Flash per le animazioni incorporate in molti siti web, RealPlayer, Sun Java, e così via. L'obiettivo è di fornire un sistema di lavoro 100% fuori dalla scatola. Mepis è internazionalizzata e gestisce molte lingue. <ulink type="block" url="http://www.mepis.org/" />

source: Aptosid (Formerly Sidux)
it_it: Aptosid (Formalmente Sidux)

source: <indexterm><primary>Sidux</primary></indexterm> <indexterm><primary>Aptosid</primary></indexterm> This community-based distribution tracks the changes in Debian <emphasis role="distribution">Sid</emphasis> (<emphasis role="distribution">Unstable</emphasis>) — hence its name — and tries to release 4 new versions each year. The modifications are limited in scope: the goal is to provide the most recent software and to update drivers for the most recent hardware, while still allowing users to switch back to the official Debian distribution at any time. <ulink type="block" url="http://aptosid.com" />
it_it: <indexterm><primary>Sidux</primary></indexterm> <indexterm><primary>Aptosid</primary></indexterm> Questa distribuzione, basata sulla comunita' traccia i cambiamenti din Debian <emphasis role="distribution">Sid</emphasis> (<emphasis role="distribution">Instabile</emphasis>) - Da cui il nome - e cerca di rilasciare ogni anno 4 nuove versioni. Le modifiche sono di portata limitata: l'obiettivo è di fornire il software più recente e di aggiornare i driver per l'hardware più recente, pur consentendo agli utenti di tornare alla distribuzione ufficiale Debian in qualsiasi momento. <ulink type="block" url="http://aptosid.com" />

source: And Many More
it_it: E molti altri

source: The Distrowatch website references a huge number of Linux distributions, many of which are based on Debian. Browsing this site is a great way to get a sense of the diversity in the Free Software world. <ulink type="block" url="http://distrowatch.com" />
it_it: Il sito web Distrowatch referenzia un numero enorme di distribuzioni Linux, alcune delle quali sono basate su Debian. Navigare in questo sito e' un buon modo per dare un senso alla diversita' del mondo del software libero. <ulink type="block" url="http://distrowatch.com" />

source: The search form can help track down a distribution based on its ancestry. In January 2012, selecting Debian led to 141 active distributions! <ulink type="block" url="http://distrowatch.com/search.php" />
it_it: Il modulo di ricerca puo' aiutare a rintracciare una distribuzione basata sulla sua discendenza. A gennaio 2012, Debian ha portato a 141 distribuzioni attive!<ulink type="block" url="http://distrowatch.com/search.php" />
